src/main/resources/testRequests.txt

<!--Поиск по логину-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest>
            <gs:login>login</gs:login>
        </gs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>

<!--Удаление-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost">
<soapenv:Header/>
<soapenv:Body>
    <gs:delUserRequest>
        <gs:login>login</gs:login>
    </gs:delUserRequest>
</soapenv:Body>
</soapenv:Envelope>

<!--Создание-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost">
<soapenv:Header/>
<soapenv:Body>
    <gs:createUserRequest>
        <gs:name>Name</gs:name>
        <gs:login>Login</gs:login>
        <gs:password>passW0rd!</gs:password>
        <gs:roles>
            <gs:role>admin</gs:role>
        </gs:roles>
    </gs:createUserRequest>
</soapenv:Body>
</soapenv:Envelope>